__author__ = 'Тихонов Николай Александрович'

# Задание-1:
# Ваня набрал несколько операций в интерпретаторе и получал результаты:

a = float('inf')

print(a == a**2)
print(a == a*2)
print(a > 999999)

# Вопрос: Чему была равна переменная a,
# если точно известно, что её значение не изменялось?

# Подсказка: это значение точно есть
