print('---------------------задание 1-----------------------------------------\n')

# Задание-1:
# Напишите функцию, возвращающую ряд Фибоначчи с n-элемента до m-элемента.
# Первыми элементами ряда считать цифры 1 1


def fibonacci(n, m):
    f = [0, 1]
    while len(f) < m + 1:
        f.append(f[-1] + f[-2])
    return f[n:m + 1]


print(*fibonacci(3, 7))

print('\n---------------------задание 2-----------------------------------------\n')
# Задача-2:
# Напишите функцию, сортирующую принимаемый список по возрастанию.
# Для сортировки используйте любой алгоритм (например пузырьковый).
# Для решения данной задачи нельзя использовать встроенную функцию и метод sort()


def sort_to_max(origin_list):
    for i in range(len(origin_list) - 1):
        for n in range(len(origin_list) - 1):
            if origin_list[n] > origin_list[n + 1]:
                origin_list[n], origin_list[n + 1] = origin_list[n + 1], origin_list[n]
    return origin_list


print(sort_to_max([2, 10, -12, 2.5, 20, -11, 4, 4, 0]))

print('\n---------------------задание 3-----------------------------------------\n')

# Задача-3:
# Напишите собственную реализацию стандартной функции filter.
# Разумеется, внутри нельзя использовать саму функцию filter.


def myfilter(lamb, argum):
    list = []
    for i in argum:
        if lamb(i) == True:
            list.append(i)
    return list


print(list(myfilter(lambda x: x > 5, [2, 10, -10, 8, 2, 0, 14])))

print('\n---------------------задание 4-----------------------------------------\n')

# Задача-4:
# Даны четыре точки А1(х1, у1), А2(x2 ,у2), А3(x3 , у3), А4(х4, у4).
# Определить, будут ли они вершинами параллелограмма.

# x1 = 0
# y1 = 0
# x2 = 1
# y2 = 3
# x3 = 4
# y3 = 3
# x4 = 3
# y4 = 0


A1 = {'x': 0, 'y': 0}
A2 = {'x': 1, 'y': 3}
A3 = {'x': 4, 'y': 3}
A4 = {'x': 3, 'y': 0}


def check():
    # вычислю разницу координат сторон параллелограмма, если равны, то его стороны паралельны
    if A1['x'] - A4['x'] == A2['x'] - A3['x'] and A1['y'] - A4['y'] == A2['y'] - A3['y']:
        if A2['x'] - A1['x'] == A3['x'] - A4['x'] and A2['y'] - A1['y'] == A3['y'] - A4['y']:
            print('заданные числа ЯВЛЯЮТСЯ вершинами параллелограма')
        else:
            print('это не вершины параллелограмма')
    else:
        print('это не вершины параллелограмма')


check()
